// Aplicar uma configuração
DmOS(config)#commit  

// Conferir a configuração sem aplicá-la
DmOS(config)#commit check  
// Failed: 'interface gigabit-ethernet': Interface gigabit-ethernet-1/1/16:  
// Forced Speed/Duplex 10M/Full-Duplex unavailable for this port.  

// Aplicar a configuração temporariamente – Exclusivo para modo Config Exclusive
DmOS(config)#commit confirmed <timeout in minutes | enter>  
// Warning: The configuration will be reverted if you exit the CLI  
// without performing the commit operation within 10 minutes.  

// Abortar a aplicação da configuração temporária antes do tempo default
DmOS(config)#commit abort  
// Confirmed commit operation not confirmed by admin from cli configuration rolled back.  

// Verificar os commits realizados
DmOS#show configuration commit list  